Repository: Thanatermesis/enventor-experiment
Catalog: po/*.po
Languages: ka

source: Failed to generate tmp folder!
ka: დროებითი საქაღალდის შექმნის შეცდომა!

source: Cannot create a config folder "%s"
ka: კონფიგურაციის საქაღალდის ("%s") შექმნის შეცდომა

source: Cannot create a enventor config folder "%s"
ka: Enventor-ის კონფიგურაციის საქაღალდის ("%s") შექმნის შეცდომა

source: Cannot save a config file "%s"
ka: კონფიგურაციის ფაილის ("%s") შენახვის შეცდომა

source: Cannot load a config file "%s"
ka: კონფიგურაციის ფაილის ("%s") ჩატვირთვის შეცდომა

source: Failed to allocate Memory!
ka: მეხსიერების გამოყოფის შეცდომა!

source: EDC has been changed on the file system.
ka: ფაილურ სისტემაზე EDC შეიცვალა.

source: Do you want to replace the contents?
ka: გნებავთ შემცველობის ჩანაცვლება?

source: Save As
ka: შენახვა, როგორც

source: Replace
ka: ჩანაცვლება

source: Ignore
ka: იგნორი

source: File saved. "%s"
ka: ფაილი შენახულია. "%s"

source: Already saved. "%s"
ka: უკვე შენახულია. "%s"

source: Invalid line number
ka: ხაზის არასწორი ნომერი

source: Enventor Goto Line
ka: Enventor ხაზზე გადასვლა

source: Go to Line
ka: ხაზზე გადასვლა

source: Enter line number [1..%d]:
ka: შეიყვანეთ ხაზის ნომერი [1..%d]:

source: Ok
ka: დიახ

source: Failed to grab key - Escape
ka: ღილაკის ჩაჭერის შეცდომა - Escape

source: Failed to grab key - %s
ka: ღილაკის ჩაჭერის შეცდომა - %s

source: Double click part to confirm.(Esc = cancel, Direction Key = move item per pixel,Ctrl = disable auto-aligning)
ka: ორმაგი წკაპი დასადასტურებლად .(Esc = გასაუქმებლად, მიმართულების ისარი = ჩანაწერის ერთი პიქსელით გადატანა,Ctrl = ავტომატური სწორების გამორთვა)

source: Add a Rect part to the live view.<br>A Rect part is used as a solid color<br>component or clipping other components.
ka: ცოცხალი ხედისთვის მრავალკუთხედი ნაწილის დამატება.<br>მრავალკუთხედი ნაწილი შეგიძლიათ ერთგვარი ფერის<br>კომპონენტის ან სხვა კომპონენტების მისამაგრებლად გამოიყენოთ.

source: Add a Text part to the live view.<br>A Text part is used for plain text.
ka: ცოცხალ ხედზე ტექსტის ნაწილის დამატება.<br>ტექსტის ნაწილი უბრალო ტექსტისთვის გამოიყენება.

source: Add an Image part to the live view.<br>An Image part contains a single image<br>resource, usually an image file.
ka: ცოცხალი ხედისთვის გამოსახულების ნაწილის დამატება.<br>გამოსახულების ნაწილი ერთ გამოსახულების<br>რესურსს შეიცავს, ჩვეულებრივ სურათის ფაილს.

source: Add a Swallow part to the live view.<br>A Swallow part is a placeholder for<br>objects that you may want to<br>include in the layout later.
ka: ცოცხალი ხედისთვის Swallow ნაწილის დამატება.<br>Swallow ნაწილი ადგილმჭერია <br> ობიექტებისთვის, რომლების ჩასმაც შეიძლება<br>მოგვიანებით მოგინდეთ.

source: Add a Textblock part to the live view.<br>A Textblock part is a rich-text part<br>that can show big chunks of text.
ka: ცოცხალი ხედისთვის ტექსტური ბლოკის ნაწილის დამატება.<br>ტექსტური ბლოკის ნაწილ მდიდარი ტექსტის ნაწილია,<br>რომელსაც დიდი ტექსტების ჩვენება შეუძლია.

source: Add a Spacer part to the live view.<br>A Spacer part is an anchor to locate <br>other parts. It is invisible and<br>normally used for padding.
ka: ცოცხალი ხედისთვის Spacer ნაწილის დამატება.<br>ნაწილი Spacer მარყუჟია, რითიც<br>სხვა ნაწილებს იპოვით. ის უჩინარია და ჩვეულებრივ<br>გამოტოვებებისთვის გამოიყენება.

source: Faild to allocate Memory!
ka: მეხსიერების გამოყოფის შეცდომა!

source: Font Size: %1.1fx
ka: ფონტის ზომა: %1.1fx

source: Cannot create temporary diretory "%s"
ka: დროებითი საქაღალდის შექმნის შეცდომა (%s)

source: New File: Choose a Template
ka: ახალი ფაილი: აირჩიეთ ნიმუში

source: Cancel
ka: გაუქმება

source: You have unsaved changes.
ka: გაქვთ შეუნახავი ცვლილებები.

source: Do you want to save the changes?
ka: გსურთ ცვლილებების შენახვა?

source: Save
ka: შენახვა

source: Discard
ka: გაუქმება

source: Choose a file to save
ka: აირჩიეთ შესანახი ფაილი

source: Failed to save: %s.
ka: შენახვის შეცდომა: %s.

source: Support only .edc file.
ka: მხარდაჭერილია მხოლოდ .edc ფაილი.

source: Choose a file to load.
ka: აირჩიეთ ჩასატვირთი ფაილი.

source: Failed to load: %s.
ka: ჩატვირთვის შეცდომა: %s.

source: Save File: Choose a EDC
ka: ფაილის შენახვა: აირჩიეთ EDC

source: Close
ka: დახურვა

source: Load File: Choose a EDC
ka: ფაილის ჩატვირთვა: აირჩიეთ EDC

source: Load
ka: ჩატვირთვა

source: New
ka: ახალი

source: Settings
ka: მორგება

source: Help
ka: დახმარება

source: Exit
ka: გასვლა

source: Cannot find templates folder! "%s"
ka: ნიმუშების საქაღალდე ვერ ვიპოვე! "%s"

source: Cannot find file! "%s"
ka: ფაილი ვერ ვიპოვე! "%s"

source: %d matches replaced
ka: ჩანაცვლებულია %d დამთხვევა

source: No "%s" in the text
ka: ტექსტში "%s" აღმოჩენილი არაა

source: Previous
ka: წინა

source: Next
ka: შემდეგი

source: Enventor Search
ka: Enventor-ით ძებნა

source: Find/Replace
ka: ძებნა/ჩანაცვლება

source: Replace All
ka: ყველას ჩანაცვლება

source: Preferences
ka: მორგება

source: Text Editor
ka: ტექსტური რედაქტორი

source: EDC Build
ka: EDC-ის აგება

source: Apply
ka: გადატარება

source: Reset
ka: საწყისი მნიშვნელობებზე დაბრუნება

source: View zoom level (Ctrl + Mouse Wheel)<br>Zoom the live view in or out.
ka: გადიდების დონის ნახვა (Ctrl + თაგუნას ბორბალი)<br>ცოცხალი ხედის გადიდება/დაპატარავება.

source: Resize the width and height of the live view.
ka: ცოცხალი ხედის სიგრძისა და სიგანის შეცვლა.

source: Swap the width and height of the live view.
ka: ცოცხალი ხედის სიგრძისა და სიგანის მიმოცვლა.

source: Mouse cursor position in live view.<br>Absolute coordinate | Relative coordinate.
ka: თაგუნას კურსორის პოზიცია ცოცხალ ხედში.<br>აბსოლუტური კოორდინატები | ფარდობითი კოორდინატები.

source: Name of the current editing group.
ka: მიმდინარე ჩასწორების ჯგუფის სახელი.

source: Cursor line number : Max line number
ka: კურსორის ხაზის სახელი : მაქს ხაზის ნომერი

source: Failed to open file "%s"
ka: ვერ მოხერხდა ფაილის გახსნა "%s"

source: Double click a keyword to change its color :
ka: საკვანძო სიტყვის ფერის შესაცვლელად ორჯერ დააწკაპუნეთ :

source: Font Name
ka: ფონტის სახელი

source: Font Style
ka: ფონტის სტილი

source: Redo text.
ka: ტექსტის დაბრუნება.

source: No text to be redo.
ka: დასაბრუნებელი ტექსტის გარეშე.

source: Undo text.
ka: ტექსტის გაუქმება.

source: No text to be undo.
ka: გასაუქმებელი ტექსტის გარეშე.

source: Part highlighting (Ctrl + H)<br>Show a highlight effect on the selected part<br>in the live view.
ka: ნაწილის გამოკვეთა (Ctrl + H)<br>ცოცხალ ხედში მონიშნული ნაწილის<br>გამოკვეთის ეფექტი.

source: Dummy parts (Ctrl + U)<br>Display virtual images for the swallow and<br>spacer parts.
ka: ცარიელი ნაწილები (Ctrl + U)<br>აჩვენებს ვირტუალურ გამოსახულებებს Swallow და <br>Spacer ნაწილებისთვის.

source: Wireframes (Ctrl + W)<br>Display wireframes to identify the parts<br>boundaries.
ka: მოდელები (Ctrl + W)<br>მოდელების ჩვენება ნაწილების<br>საზღვრების საცნობად.

source: Mirror mode (Ctrl + M)<br>Invert the layout horizontally and review<br>the designed layout in RTL(right-to-left)<br>LTR(left-to-right) settings.
ka: სარკის რეჟიმი (Ctrl + M)<br>განლაგების ჰორიზონტალური ინვერსია<br>და მიღებული განლაგების მიმოხილვა RTL(მარჯვნიდან მარცხნივ)<br>LTR(მარცხნიდან მარჯვნივ) პარამეტრებში.

source: Save the file (Ctrl + S)<br>Save the current script to a file.
ka: ფაილის შენახვა (Ctrl + S)<br>მიმდინარე სკრიპტის ფაილში შენახვა.

source: Undo text (Ctrl + Z)
ka: ტექსტის გაუქმება (Ctrl + Z)

source: Redo text (Ctrl + R)
ka: ტექსტის დაბრუნება (Ctrl + R)

source: Find/Replace (Ctrl + F)<br>Find or replace text.
ka: პოვნა/ჩანაცვლება (Ctrl + F)<br>იპოვეთ ან ჩაანაცვლეთ ტექსტი.

source: Go to line (Ctrl + L)<br>Open the Go to window to move the cursor<br>line position.
ka: ხაზზე გადასვლა (Ctrl + L)<br>გადასვლის განჯრის გახსნა კურსორის<br>სასურველ ხაზზე გადასატანად.

source: Line numbers<br>Display the script line numbers.
ka: ხაზის ნომრები<br>სკრიპტის ხაზის ნომრების ჩვენება.

source: Insert a code snippet (Ctrl + T)<br>Enventor chooses the best code with regards<br>to the current editing context. For instance,<br>if the cursor is inside a part section,<br>description code is generated.
ka: კოდის ნაწყვეტის ჩასმა (Ctrl + T)<br>Enventor აირჩევს კოდის საუკეთსო ნაწილს მიმდინარე ჩასწორების კონტექსტის გათვალისწინებით.<br>მაგალითად, თუ კურსორი,<br>ნაწილის კოდის სექციაშია,<br>გენერირდება აღწერის კოდი.

source: Console box (Alt + Down)<br>Display the console box, which shows the EDC<br>build logs, such as error messages. It pops<br>up automatically when compilation errors occur.
ka: კონსოლის ფანჯარა (Alt + Down)<br>აჩვენებს კონსოლის ფანჯარა, რომელშიც EDC-ის ნახვა შეგეძლებათ, როგორიცაა<br>აგების ჟურნალი და შეცდომები.<br>ის აგების შეცდომების დროს ავტომატურად ამოხტება.

source: File browser (F9)<br>Display the file browser, which shows a file list<br>in current workspace.
ka: ფაილების ბრაუზერი (F9)<br>ფაილების ბრაუზერის ჩვენება. ს მიმდინარე სამუშაო სივრცეში<br>არსებულ ფაილებს აჩვენებს.

source: EDC navigator (F10)<br>Display the EDC navigator, which shows the current<br>group hierarchy tree that contains parts,<br>descriptions and programs lists.
ka: EDC ნავიგატორი (F10)<br>EDC ნავიგატორი, რომელიც აჩვენებს მიმდინარე<br>ჯგუფის იერარქიას, რომელიც ნაწილებს,<br>აღწერებს და პროგრამის სიებს შეიძლება შეიცავდეს.

source: File tab (F11)<br>Display the file tab in the bottom area<br>It shows an opened file list to switch<br>files quickly.
ka: ფაილის ჩანართი (F11)<br>აჩვენებს ფაილის ჩანართს ქვედა მხარეში<br>ის ჩვენებს გახსნილი ფაილების სიას<br>მათ შორის ადგილად გადასართველად.

source: Enventor menu (Esc)<br>Open the Enventor main menu.
ka: Enventor-ის მენიუ (Esc)<br>Enventor-ის მთავარი მენიუს გახსნა.

source: Part highlighting enabled.
ka: ნაწილის გამოკვეთა ჩართულია.

source: Part highlighting disabled.
ka: ნაწილის გამოკვეთა გამორთულია.

source: Dummy parts enabled.
ka: უაზრო ნაწილები ჩართულია.

source: Dummy parts disabled.
ka: უაზრო ნაწილები გამორთულია.

source: Wireframes enabled.
ka: მოდელი ჩართულია.

source: Wireframes disabled.
ka: მოდელი გამორთულია.

source: Mirror mode enabled.
ka: სარკის რეჟიი ჩართულია.

source: Mirror mode disabled.
ka: სარკის რეჟიი გამორთულია.

source: Insertion of template code is disabled while in Live Edit mode
ka: ცოცხალი ჩასწორების რეჟიმში ნიმუშის ჩართვა გათიშულია

source: Template code inserted, (%s)
ka: ნიმუშის კოდი ჩასმულია. (%s)

source: Can't insert template code here. Move the cursor inside the "Collections,Images,Parts,Part,Programs" scope.
ka: აქ ნიმუშის კოდს ვერ ჩასვამთ. გადაიტანეთ კურსორი "Collections,Images,Parts,Part,Programs" დიაპაზონში.
